In [1]:
import requests
import PyPDF2  
import camelot

In [2]:
url = "https://nirfcdn.azureedge.net/2020/pdf/Engineering/IR-E-C-48145.pdf"

In [3]:
data=requests.get(url)

In [4]:
with open('IR-E-U-0456.pdf','wb') as f:
    f.write(data.content)

In [5]:
tables = camelot.read_pdf('IR-E-U-0456.pdf')

In [6]:
tables[1].df

,0,1,2,3,4,5,6,7,8,9
0,Academic Year,No. of first year\nstudents intake in the\nyear,No. of first year\nstudents admitted in\nthe year,Academic Year,No. of students\nadmitted through\nLateral entry,Academic Year,No. of students\ngraduating in\nminimum stipul...,No. of students\nplaced,Median salary of\nplaced\ngraduates(Amount in\...,No. of students\nselected for Higher\nStudies
1,2013-14,240,239,2014-15,24,2016-17,244,196,315000(Three lakhs\nFifteen thousands),20
2,2014-15,360,356,2015-16,41,2017-18,360,235,315000(Three lakhs\nFifteen thousands),25
3,2015-16,360,355,2016-17,42,2018-19,353,254,380000(Three lakhs\nEighty thousands),23

In [7]:
int(tables[1].df[1][1])

240

In [8]:
tables[0].df

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,(All programs\nof all years),No. of Male\nStudents,No. of Female\nStudents,Total Students,Within State\n(Including male\n& female),Outside State\n(Including male\n& female),Outside\nCountry\n(Including male\n& female),Economically\nBackward\n(Including male\n& fem...,Socially\nChallenged\n(SC+ST+OBC\nIncluding ma...,No. of students\nreceiving full\ntuition fee\n...,No. of students\nreceiving full\ntuition fee\n...,No. of students\nreceiving full\ntuition fee\n...,No. of students\nwho are not\nreceiving full\n...
1,UG [4 Years\nProgram(s)],0,1557,1557,1325,232,0,154,501,147,26,16,466

In [14]:
tables[1].df

,0,1,2,3,4,5,6,7,8,9
0,Academic Year,No. of first year\nstudents intake in the\nyear,No. of first year\nstudents admitted in\nthe year,Academic Year,No. of students\nadmitted through\nLateral entry,Academic Year,No. of students\ngraduating in\nminimum stipul...,No. of students\nplaced,Median salary of\nplaced\ngraduates(Amount in\...,No. of students\nselected for Higher\nStudies
1,2013-14,240,239,2014-15,24,2016-17,244,196,315000(Three lakhs\nFifteen thousands),20
2,2014-15,360,356,2015-16,41,2017-18,360,235,315000(Three lakhs\nFifteen thousands),25
3,2015-16,360,355,2016-17,42,2018-19,353,254,380000(Three lakhs\nEighty thousands),23

In [10]:
url.split('/')[-1]

'IR-E-C-48145.pdf'

In [11]:
x = tables[2].df

In [12]:
x[2][3]

'0'

In [13]:
x

,0,1,2,3
0,Ph.D (Student pursuing doctoral program till 2...,,,
1,,,Total Students,
2,Full Time,,0,
3,Part Time,,0,
4,No. of Ph.D students graduated (including Inte...,,,
5,,2018-19,2017-18,2016-17
6,Full Time,0,0,0
7,Part Time,0,0,0